; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph6 - mode
	spectrograph5 - mode
	thermograph2 - mode
	image1 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	image3 - mode
	Star2 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(supports instrument3 image3)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument4 image3)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star5)
	(supports instrument5 spectrograph6)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star5)
	(supports instrument7 image3)
	(supports instrument7 spectrograph5)
	(calibration_target instrument7 Star3)
	(supports instrument8 image3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite1 Planet8)
	(pointing satellite3 Star0)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 image3)
	(have_image Planet8 image3)
	(have_image Planet8 thermograph2)
	(have_image Planet9 spectrograph0)
	(have_image Planet9 thermograph2)
	(have_image Star10 spectrograph0)
	(have_image Star11 spectrograph4)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star0)
   goals met: 1 of 12
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 12
3. (calibrate satellite3 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 1 of 12
4. (turn_to satellite3 star7 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star7)
   goals met: 0 of 12
5. (take_image satellite3 star7 instrument8 image3)
   added: (have_image star7 image3)
   goals met: 1 of 12
6. (turn_to satellite3 planet9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet9)
   goals met: 1 of 12
7. (take_image satellite3 planet9 instrument8 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 2 of 12
8. (turn_to satellite3 planet8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet8)
   goals met: 2 of 12
9. (turn_to satellite1 star5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star5)
   goals met: 2 of 12
10. (take_image satellite3 planet8 instrument8 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 3 of 12
11. (take_image satellite3 planet8 instrument8 image3)
   added: (have_image planet8 image3)
   goals met: 4 of 12
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 12
13. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 4 of 12
14. (turn_to satellite1 phenomenon12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 12
15. (take_image satellite1 phenomenon12 instrument2 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 12
16. (turn_to satellite1 phenomenon6 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 12
17. (take_image satellite1 phenomenon6 instrument2 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 6 of 12
18. (turn_to satellite1 planet9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet9)
   goals met: 6 of 12
19. (take_image satellite1 planet9 instrument2 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 7 of 12
20. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 7 of 12
21. (take_image satellite1 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 12
22. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 8 of 12
23. (take_image satellite1 star11 instrument2 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 9 of 12
24. (take_image satellite1 star11 instrument2 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 10 of 12
25. (turn_to satellite1 planet8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet8)
   goals met: 11 of 12
26. (turn_to satellite3 star0 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star0)
   goals met: 12 of 12
